apache/nuttx/arch/arm/src/xmc4/hardware/xmc4_ccu4.h
/****************************************************************************
 * arch/arm/src/xmc4/hardware/xmc4_ccu4.h
 *
 *   Copyright (C) 2017 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * May include some logic from sample code provided by Infineon:
 *
 * Copyright (C) 2011-2015 Infineon Technologies AG. All rights reserved.
 *
 * Infineon Technologies AG (Infineon) is supplying this software for use
 * with Infineon's microcontrollers.  This file can be freely distributed
 * within development tools that are supporting such microcontrollers.
 *
 * THIS SOFTWARE IS PROVIDED AS IS. NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS
 * SOFTWARE. INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL,
 * INCIDENTAL, OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 ****************************************************************************/

/* Reference: XMC4500 Reference Manual V1.5 2014-07 Microcontrollers. */

#ifndef __ARCH_ARM_SRC_XMC4_HARDWARE_XMC4_CCU4_H
#define __ARCH_ARM_SRC_XMC4_HARDWARE_XMC4_CCU4_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "hardware/xmc4_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

/* CCU4 Global Registers */

#define XMC4_CCU4_GCTRL_OFFSET             0x0000   /* Module General Control Register */
#define XMC4_CCU4_GSTAT_OFFSET             0x0004   /* General Slice Status Register */
#define XMC4_CCU4_GIDLS_OFFSET             0x0008   /* General Idle Enable Register */
#define XMC4_CCU4_GIDLC_OFFSET             0x000C   /* General Idle Disable Register */
#define XMC4_CCU4_GCSS_OFFSET              0x0010   /* General Channel Set Register */
#define XMC4_CCU4_GCSC_OFFSET              0x0014   /* General Channel Clear Register */
#define XMC4_CCU4_GCST_OFFSET              0x0018   /* General Channel Status Register */
#define XMC4_CCU4_MIDR_OFFSET              0x0080   /* Module Identification Register */

/* CCU40 Registers */

#define XMC4_CCU4_CC40INS_OFFSET           0x0100   /* Input Selector Unit Configuration */
#define XMC4_CCU4_CC40CMC_OFFSET           0x0104   /* Connection Matrix Configuration */
#define XMC4_CCU4_CC40TST_OFFSET           0x0108   /* Timer Run Status */
#define XMC4_CCU4_CC40TCSET_OFFSET         0x010C   /* Timer Run Set */
#define XMC4_CCU4_CC40TCCLR_OFFSET         0x0110   /* Timer Run Clear */
#define XMC4_CCU4_CC40TC_OFFSET            0x0114   /* General Timer Configuration */
#define XMC4_CCU4_CC40PSL_OFFSET           0x0118   /* Output Passive Level Configuration */
#define XMC4_CCU4_CC40DIT_OFFSET           0x011C   /* Dither Configuration */
#define XMC4_CCU4_CC40DITS_OFFSET          0x0120   /* Dither Shadow Register */
#define XMC4_CCU4_CC40PSC_OFFSET           0x0124   /* Prescaler Configuration */
#define XMC4_CCU4_CC40FPC_OFFSET           0x0128   /* Prescaler Compare Value */
#define XMC4_CCU4_CC40FPCS_OFFSET          0x012C   /* Prescaler Shadow Compare Value */
#define XMC4_CCU4_CC40PR_OFFSET            0x0130   /* Timer Period Value */
#define XMC4_CCU4_CC40PRS_OFFSET           0x0134   /* Timer Period Shadow Value */
#define XMC4_CCU4_CC40CR_OFFSET            0x0138   /* Timer Compare Value */
#define XMC4_CCU4_CC40CRS_OFFSET           0x013C   /* Timer Compare Shadow Value */
#define XMC4_CCU4_CC40TIMER_OFFSET         0x0170   /* Timer Current Value */
#define XMC4_CCU4_CC40C0V_OFFSET           0x0174   /* Capture Register 0 Value */
#define XMC4_CCU4_CC40C1V_OFFSET           0x0178   /* Capture Register 1 Value */
#define XMC4_CCU4_CC40C2V_OFFSET           0x017C   /* Capture Register 2 Value */
#define XMC4_CCU4_CC40C3V_OFFSET           0x0180   /* Capture Register 3 Value */
#define XMC4_CCU4_CC40INTS_OFFSET          0x01A0   /* Interrupt Status */
#define XMC4_CCU4_CC40INTE_OFFSET          0x01A4   /* Interrupt Enable */
#define XMC4_CCU4_CC40SRS_OFFSET           0x01A8   /* Interrupt Configuration */
#define XMC4_CCU4_CC40SWS_OFFSET           0x01AC   /* Interrupt Status Set */
#define XMC4_CCU4_CC40SWR_OFFSET           0x01B0   /* Interrupt Status Clear */
#define XMC4_CCU4_CC40ECRD0_OFFSET         0x01B8   /* Extended Read Back 0 */
#define XMC4_CCU4_CC40ECRD1_OFFSET         0x01BC   /* Extended Read Back 1 */

