apache/nuttx/arch/arm/src/xmc4/hardware/xmc4_ccu4.h
/* CCU41 Registers */

#define XMC4_CCU4_CC41INS_OFFSET           0x0200   /* Input Selector Unit Configuration */
#define XMC4_CCU4_CC41CMC_OFFSET           0x0204   /* Connection Matrix Configuration */
#define XMC4_CCU4_CC41TST_OFFSET           0x0208   /* Timer Run Status */
#define XMC4_CCU4_CC41TCSET_OFFSET         0x020C   /* Timer Run Set */
#define XMC4_CCU4_CC41TCCLR_OFFSET         0x0210   /* Timer Run Clear */
#define XMC4_CCU4_CC41TC_OFFSET            0x0214   /* General Timer Configuration */
#define XMC4_CCU4_CC41PSL_OFFSET           0x0218   /* Output Passive Level Configuration */
#define XMC4_CCU4_CC41DIT_OFFSET           0x021C   /* Dither Configuration */
#define XMC4_CCU4_CC41DITS_OFFSET          0x0220   /* Dither Shadow Register */
#define XMC4_CCU4_CC41PSC_OFFSET           0x0224   /* Prescaler Configuration */
#define XMC4_CCU4_CC41FPC_OFFSET           0x0228   /* Prescaler Compare Value */
#define XMC4_CCU4_CC41FPCS_OFFSET          0x022C   /* Prescaler Shadow Compare Value */
#define XMC4_CCU4_CC41PR_OFFSET            0x0230   /* Timer Period Value */
#define XMC4_CCU4_CC41PRS_OFFSET           0x0234   /* Timer Period Shadow Value */
#define XMC4_CCU4_CC41CR_OFFSET            0x0238   /* Timer Compare Value */
#define XMC4_CCU4_CC41CRS_OFFSET           0x023C   /* Timer Compare Shadow Value */
#define XMC4_CCU4_CC41TIMER_OFFSET         0x0270   /* Timer Current Value */
#define XMC4_CCU4_CC41C0V_OFFSET           0x0274   /* Capture Register 0 Value */
#define XMC4_CCU4_CC41C1V_OFFSET           0x0278   /* Capture Register 1 Value */
#define XMC4_CCU4_CC41C2V_OFFSET           0x027C   /* Capture Register 2 Value */
#define XMC4_CCU4_CC41C3V_OFFSET           0x0280   /* Capture Register 3 Value */
#define XMC4_CCU4_CC41INTS_OFFSET          0x02A0   /* Interrupt Status */
#define XMC4_CCU4_CC41INTE_OFFSET          0x02A4   /* Interrupt Enable */
#define XMC4_CCU4_CC41SRS_OFFSET           0x02A8   /* Interrupt Configuration */
#define XMC4_CCU4_CC41SWS_OFFSET           0x02AC   /* Interrupt Status Set */
#define XMC4_CCU4_CC41SWR_OFFSET           0x02B0   /* Interrupt Status Clear */
#define XMC4_CCU4_CC41ECRD0_OFFSET         0x02B8   /* Extended Read Back 0 */
#define XMC4_CCU4_CC41ECRD1_OFFSET         0x02BC   /* Extended Read Back 1 */

/* CCU42 Registers */

#define XMC4_CCU4_CC42INS_OFFSET           0x0300   /* Input Selector Unit Configuration */
#define XMC4_CCU4_CC42CMC_OFFSET           0x0304   /* Connection Matrix Configuration */
#define XMC4_CCU4_CC42TST_OFFSET           0x0308   /* Timer Run Status */
#define XMC4_CCU4_CC42TCSET_OFFSET         0x030C   /* Timer Run Set */
#define XMC4_CCU4_CC42TCCLR_OFFSET         0x0310   /* Timer Run Clear */
#define XMC4_CCU4_CC42TC_OFFSET            0x0314   /* General Timer Configuration */
#define XMC4_CCU4_CC42PSL_OFFSET           0x0318   /* Output Passive Level Configuration */
#define XMC4_CCU4_CC42DIT_OFFSET           0x031C   /* Dither Configuration */
#define XMC4_CCU4_CC42DITS_OFFSET          0x0320   /* Dither Shadow Register */
#define XMC4_CCU4_CC42PSC_OFFSET           0x0324   /* Prescaler Configuration */
#define XMC4_CCU4_CC42FPC_OFFSET           0x0328   /* Prescaler Compare Value */
#define XMC4_CCU4_CC42FPCS_OFFSET          0x032C   /* Prescaler Shadow Compare Value */
#define XMC4_CCU4_CC42PR_OFFSET            0x0330   /* Timer Period Value */
#define XMC4_CCU4_CC42PRS_OFFSET           0x0334   /* Timer Period Shadow Value */
#define XMC4_CCU4_CC42CR_OFFSET            0x0338   /* Timer Compare Value */
#define XMC4_CCU4_CC42CRS_OFFSET           0x033C   /* Timer Compare Shadow Value */
#define XMC4_CCU4_CC42TIMER_OFFSET         0x0370   /* Timer Current Value */
#define XMC4_CCU4_CC42C0V_OFFSET           0x0374   /* Capture Register 0 Value */
#define XMC4_CCU4_CC42C1V_OFFSET           0x0378   /* Capture Register 1 Value */
#define XMC4_CCU4_CC42C2V_OFFSET           0x037C   /* Capture Register 2 Value */
#define XMC4_CCU4_CC42C3V_OFFSET           0x0380   /* Capture Register 3 Value */
#define XMC4_CCU4_CC42INTS_OFFSET          0x03A0   /* Interrupt Status */
#define XMC4_CCU4_CC42INTE_OFFSET          0x03A4   /* Interrupt Enable */
#define XMC4_CCU4_CC42SRS_OFFSET           0x03A8   /* Interrupt Configuration */
#define XMC4_CCU4_CC42SWS_OFFSET           0x03AC   /* Interrupt Status Set */
#define XMC4_CCU4_CC42SWR_OFFSET           0x03B0   /* Interrupt Status Clear */
#define XMC4_CCU4_CC42ECRD0_OFFSET         0x03B8   /* Extended Read Back 0 */
#define XMC4_CCU4_CC42ECRD1_OFFSET         0x03BC   /* Extended Read Back 1 */

/* CCU43 Registers */

#define XMC4_CCU4_CC43INS_OFFSET           0x0400   /* Input Selector Unit Configuration */
#define XMC4_CCU4_CC43CMC_OFFSET           0x0404   /* Connection Matrix Configuration */
#define XMC4_CCU4_CC43TST_OFFSET           0x0408   /* Timer Run Status */
#define XMC4_CCU4_CC43TCSET_OFFSET         0x040C   /* Timer Run Set */
#define XMC4_CCU4_CC43TCCLR_OFFSET         0x0410   /* Timer Run Clear */
#define XMC4_CCU4_CC43TC_OFFSET            0x0414   /* General Timer Configuration */
#define XMC4_CCU4_CC43PSL_OFFSET           0x0418   /* Output Passive Level Configuration */
#define XMC4_CCU4_CC43DIT_OFFSET           0x041C   /* Dither Configuration */
#define XMC4_CCU4_CC43DITS_OFFSET          0x0420   /* Dither Shadow Register */
#define XMC4_CCU4_CC43PSC_OFFSET           0x0424   /* Prescaler Configuration */
#define XMC4_CCU4_CC43FPC_OFFSET           0x0428   /* Prescaler Compare Value */
#define XMC4_CCU4_CC43FPCS_OFFSET          0x042C   /* Prescaler Shadow Compare Value */
#define XMC4_CCU4_CC43PR_OFFSET            0x0430   /* Timer Period Value */
#define XMC4_CCU4_CC43PRS_OFFSET           0x0434   /* Timer Period Shadow Value */
#define XMC4_CCU4_CC43CR_OFFSET            0x0438   /* Timer Compare Value */
#define XMC4_CCU4_CC43CRS_OFFSET           0x043C   /* Timer Compare Shadow Value */
#define XMC4_CCU4_CC43TIMER_OFFSET         0x0470   /* Timer Current Value */
#define XMC4_CCU4_CC43C0V_OFFSET           0x0474   /* Capture Register 0 Value */
#define XMC4_CCU4_CC43C1V_OFFSET           0x0478   /* Capture Register 1 Value */
#define XMC4_CCU4_CC43C2V_OFFSET           0x047C   /* Capture Register 2 Value */
#define XMC4_CCU4_CC43C3V_OFFSET           0x0480   /* Capture Register 3 Value */
#define XMC4_CCU4_CC43INTS_OFFSET          0x04A0   /* Interrupt Status */
#define XMC4_CCU4_CC43INTE_OFFSET          0x04A4   /* Interrupt Enable */
#define XMC4_CCU4_CC43SRS_OFFSET           0x04A8   /* Interrupt Configuration */
#define XMC4_CCU4_CC43SWS_OFFSET           0x04AC   /* Interrupt Status Set */
#define XMC4_CCU4_CC43SWR_OFFSET           0x04B0   /* Interrupt Status Clear */
#define XMC4_CCU4_CC43ECRD0_OFFSET         0x04B8   /* Extended Read Back 0 */
#define XMC4_CCU4_CC43ECRD1_OFFSET         0x04BC   /* Extended Read Back 1 */

