apache/nuttx/arch/arm/src/xmc4/hardware/xmc4_ccu4.h
#define XMC4_CCU4_CC42INS            (XMC4_CCU42_BASE+XMC4_CCU4_CC42INS_OFFSET)
#define XMC4_CCU4_CC42CMC            (XMC4_CCU42_BASE+XMC4_CCU4_CC42CMC_OFFSET)
#define XMC4_CCU4_CC42TST            (XMC4_CCU42_BASE+XMC4_CCU4_CC42TST_OFFSET)
#define XMC4_CCU4_CC42TCSET          (XMC4_CCU42_BASE+XMC4_CCU4_CC42TCSET_OFFSET)
#define XMC4_CCU4_CC42TCCLR          (XMC4_CCU42_BASE+XMC4_CCU4_CC42TCCLR_OFFSET)
#define XMC4_CCU4_CC42TC             (XMC4_CCU42_BASE+XMC4_CCU4_CC42TC_OFFSET)
#define XMC4_CCU4_CC42PSL            (XMC4_CCU42_BASE+XMC4_CCU4_CC42PSL_OFFSET)
#define XMC4_CCU4_CC42DIT            (XMC4_CCU42_BASE+XMC4_CCU4_CC42DIT_OFFSET)
#define XMC4_CCU4_CC42DITS           (XMC4_CCU42_BASE+XMC4_CCU4_CC42DITS_OFFSET)
#define XMC4_CCU4_CC42PSC            (XMC4_CCU42_BASE+XMC4_CCU4_CC42PSC_OFFSET)
#define XMC4_CCU4_CC42FPC            (XMC4_CCU42_BASE+XMC4_CCU4_CC42FPC_OFFSET)
#define XMC4_CCU4_CC42FPCS           (XMC4_CCU42_BASE+XMC4_CCU4_CC42FPCS_OFFSET)
#define XMC4_CCU4_CC42PR             (XMC4_CCU42_BASE+XMC4_CCU4_CC42PR_OFFSET)
#define XMC4_CCU4_CC42PRS            (XMC4_CCU42_BASE+XMC4_CCU4_CC42PRS_OFFSET)
#define XMC4_CCU4_CC42CR             (XMC4_CCU42_BASE+XMC4_CCU4_CC42CR_OFFSET)
#define XMC4_CCU4_CC42CRS            (XMC4_CCU42_BASE+XMC4_CCU4_CC42CRS_OFFSET)
#define XMC4_CCU4_CC42TIMER          (XMC4_CCU42_BASE+XMC4_CCU4_CC42TIMER_OFFSET)
#define XMC4_CCU4_CC42C0V            (XMC4_CCU42_BASE+XMC4_CCU4_CC42C0V_OFFSET)
#define XMC4_CCU4_CC42C1V            (XMC4_CCU42_BASE+XMC4_CCU4_CC42C1V_OFFSET)
#define XMC4_CCU4_CC42C2V            (XMC4_CCU42_BASE+XMC4_CCU4_CC42C2V_OFFSET)
#define XMC4_CCU4_CC42C3V            (XMC4_CCU42_BASE+XMC4_CCU4_CC42C3V_OFFSET)
#define XMC4_CCU4_CC42INTS           (XMC4_CCU42_BASE+XMC4_CCU4_CC42INTS_OFFSET)
#define XMC4_CCU4_CC42INTE           (XMC4_CCU42_BASE+XMC4_CCU4_CC42INTE_OFFSET)
#define XMC4_CCU4_CC42SRS            (XMC4_CCU42_BASE+XMC4_CCU4_CC42SRS_OFFSET)
#define XMC4_CCU4_CC42SWS            (XMC4_CCU42_BASE+XMC4_CCU4_CC42SWS_OFFSET)
#define XMC4_CCU4_CC42SWR            (XMC4_CCU42_BASE+XMC4_CCU4_CC42SWR_OFFSET)
#define XMC4_CCU4_CC42ECRD0          (XMC4_CCU42_BASE+XMC4_CCU4_CC42ECRD0_OFFSET)
#define XMC4_CCU4_CC42ECRD1          (XMC4_CCU42_BASE+XMC4_CCU4_CC42ECRD1_OFFSET)

/* CCU43 Registers */

#define XMC4_CCU43_GCTRL             (XMC4_CCU43_BASE+XMC4_CCU4_GCTRL_OFFSET)
#define XMC4_CCU43_GSTAT             (XMC4_CCU43_BASE+XMC4_CCU4_GSTAT_OFFSET)
#define XMC4_CCU43_GIDLS             (XMC4_CCU43_BASE+XMC4_CCU4_GIDLS_OFFSET)
#define XMC4_CCU43_GIDLC             (XMC4_CCU43_BASE+XMC4_CCU4_GIDLC_OFFSET)
#define XMC4_CCU43_GCSS              (XMC4_CCU43_BASE+XMC4_CCU4_GCSS_OFFSET)
#define XMC4_CCU43_GCSC              (XMC4_CCU43_BASE+XMC4_CCU4_GCSC_OFFSET)
#define XMC4_CCU43_GCST              (XMC4_CCU43_BASE+XMC4_CCU4_GCST_OFFSET)
#define XMC4_CCU43_MIDR              (XMC4_CCU43_BASE+XMC4_CCU4_MIDR_OFFSET)

#define XMC4_CCU4_CC43INS            (XMC4_CCU43_BASE+XMC4_CCU4_CC43INS_OFFSET)
#define XMC4_CCU4_CC43CMC            (XMC4_CCU43_BASE+XMC4_CCU4_CC43CMC_OFFSET)
#define XMC4_CCU4_CC43TST            (XMC4_CCU43_BASE+XMC4_CCU4_CC43TST_OFFSET)
#define XMC4_CCU4_CC43TCSET          (XMC4_CCU43_BASE+XMC4_CCU4_CC43TCSET_OFFSET)
#define XMC4_CCU4_CC43TCCLR          (XMC4_CCU43_BASE+XMC4_CCU4_CC43TCCLR_OFFSET)
#define XMC4_CCU4_CC43TC             (XMC4_CCU43_BASE+XMC4_CCU4_CC43TC_OFFSET)
#define XMC4_CCU4_CC43PSL            (XMC4_CCU43_BASE+XMC4_CCU4_CC43PSL_OFFSET)
#define XMC4_CCU4_CC43DIT            (XMC4_CCU43_BASE+XMC4_CCU4_CC43DIT_OFFSET)
#define XMC4_CCU4_CC43DITS           (XMC4_CCU43_BASE+XMC4_CCU4_CC43DITS_OFFSET)
#define XMC4_CCU4_CC43PSC            (XMC4_CCU43_BASE+XMC4_CCU4_CC43PSC_OFFSET)
#define XMC4_CCU4_CC43FPC            (XMC4_CCU43_BASE+XMC4_CCU4_CC43FPC_OFFSET)
#define XMC4_CCU4_CC43FPCS           (XMC4_CCU43_BASE+XMC4_CCU4_CC43FPCS_OFFSET)
#define XMC4_CCU4_CC43PR             (XMC4_CCU43_BASE+XMC4_CCU4_CC43PR_OFFSET)
#define XMC4_CCU4_CC43PRS            (XMC4_CCU43_BASE+XMC4_CCU4_CC43PRS_OFFSET)
#define XMC4_CCU4_CC43CR             (XMC4_CCU43_BASE+XMC4_CCU4_CC43CR_OFFSET)
#define XMC4_CCU4_CC43CRS            (XMC4_CCU43_BASE+XMC4_CCU4_CC43CRS_OFFSET)
#define XMC4_CCU4_CC43TIMER          (XMC4_CCU43_BASE+XMC4_CCU4_CC43TIMER_OFFSET)
#define XMC4_CCU4_CC43C0V            (XMC4_CCU43_BASE+XMC4_CCU4_CC43C0V_OFFSET)
#define XMC4_CCU4_CC43C1V            (XMC4_CCU43_BASE+XMC4_CCU4_CC43C1V_OFFSET)
#define XMC4_CCU4_CC43C2V            (XMC4_CCU43_BASE+XMC4_CCU4_CC43C2V_OFFSET)
#define XMC4_CCU4_CC43C3V            (XMC4_CCU43_BASE+XMC4_CCU4_CC43C3V_OFFSET)
#define XMC4_CCU4_CC43INTS           (XMC4_CCU43_BASE+XMC4_CCU4_CC43INTS_OFFSET)
#define XMC4_CCU4_CC43INTE           (XMC4_CCU43_BASE+XMC4_CCU4_CC43INTE_OFFSET)
#define XMC4_CCU4_CC43SRS            (XMC4_CCU43_BASE+XMC4_CCU4_CC43SRS_OFFSET)
#define XMC4_CCU4_CC43SWS            (XMC4_CCU43_BASE+XMC4_CCU4_CC43SWS_OFFSET)
#define XMC4_CCU4_CC43SWR            (XMC4_CCU43_BASE+XMC4_CCU4_CC43SWR_OFFSET)
#define XMC4_CCU4_CC43ECRD0          (XMC4_CCU43_BASE+XMC4_CCU4_CC43ECRD0_OFFSET)
#define XMC4_CCU4_CC43ECRD1          (XMC4_CCU43_BASE+XMC4_CCU4_CC43ECRD1_OFFSET)

/* Register Bit-Field Definitions *******************************************/

/* CCU4 Global Registers */

/* Global Control Register (GCTRL) */

#define CCU4_GCTRL_PRBC_SHIFT                (0)                            /* Bits 0-2: Prescaler Clear Configuration */
#define CCU4_GCTRL_PRBC_MASK                 (7 << CCU4_GCTRL_PRBC_SHIFT)
#   define CCU4_GCTRL_PRBC_SW                (0 << CCU4_GCTRL_PRBC_SHIFT)   /*  SW only */
#   define CCU4_GCTRL_PRBC_CC40              (1 << CCU4_GCTRL_PRBC_SHIFT)   /*  When the Run Bit of CC40 is cleared */
#   define CCU4_GCTRL_PRBC_CC41              (2 << CCU4_GCTRL_PRBC_SHIFT)   /*  When the Run Bit of CC41 is cleared */
#   define CCU4_GCTRL_PRBC_CC42              (3 << CCU4_GCTRL_PRBC_SHIFT)   /*  When the Run Bit of CC42 is cleared */
#   define CCU4_GCTRL_PRBC_CC43              (4 << CCU4_GCTRL_PRBC_SHIFT)   /*  When the Run Bit of CC43 is cleared */
#define CCU4_GCTRL_PCIS_SHIFT                (4)                            /* Bits 4-5: Prescaler Input Clock Selection */
#define CCU4_GCTRL_PCIS_MASK                 (3 << CCU4_GCTRL_PCIS_SHIFT)
#   define CCU4_GCTRL_PCIS_MODULE_CLK        (0 << CCU4_GCTRL_PCIS_SHIFT)   /*  Module clock */
#   define CCU4_GCTRL_PCIS_ECLKA             (1 << CCU4_GCTRL_PCIS_SHIFT)   /*  CCU4x.ECLKA */
#   define CCU4_GCTRL_PCIS_ECLKB             (2 << CCU4_GCTRL_PCIS_SHIFT)   /*  CCU4x.ECLKB */
#   define CCU4_GCTRL_PCIS_ECLKC             (3 << CCU4_GCTRL_PCIS_SHIFT)   /*  CCU4x.ECLKC */
#define CCU4_GCTRL_SUSCFG_SHIFT              (8)                            /* Bits 8-9: Suspend Mode Configuration */
#define CCU4_GCTRL_SUSCFG_MASK               (3 << CCU4_GCTRL_SUSCFG_SHIFT)
#define CCU4_GCTRL_MSE0_SHIFT                (10)                           /* Bits 10: Slice 0 Multi Channel shadow transfer enable */
#define CCU4_GCTRL_MSE0_MASK                 (1 << CCU4_GCTRL_MSE0_SHIFT)
#define CCU4_GCTRL_MSE1_SHIFT                (11)                           /* Bits 11: Slice 1 Multi Channel shadow transfer enable */
#define CCU4_GCTRL_MSE1_MASK                 (1 << CCU4_GCTRL_MSE1_SHIFT)
#define CCU4_GCTRL_MSE2_SHIFT                (12)                           /* Bits 12: Slice 2 Multi Channel shadow transfer enable */
#define CCU4_GCTRL_MSE2_MASK                 (1 << CCU4_GCTRL_MSE2_SHIFT)
#define CCU4_GCTRL_MSE3_SHIFT                (13)                           /* Bits 13: Slice 3 Multi Channel shadow transfer enable */
#define CCU4_GCTRL_MSE3_MASK                 (1 << CCU4_GCTRL_MSE3_SHIFT)
#define CCU4_GCTRL_MSDE_SHIFT                (15)                           /* Bits 14-15: Multi Channel shadow transfer request configuration */
#define CCU4_GCTRL_MSDE_MASK                 (3 << CCU4_GCTRL_MSDE_SHIFT)

/* Global Status Register (GSTAT) */

#define CCU4_GSTAT_S0I_SHIFT          (0)                            /* Bits 0: CC40 IDLE status */
#define CCU4_GSTAT_S0I_MASK           (1 << CCU4_GSTAT_S0I_SHIFT)
#define CCU4_GSTAT_S1I_SHIFT          (1)                            /* Bits 1: CC41 IDLE status */
#define CCU4_GSTAT_S1I_MASK           (1 << CCU4_GSTAT_S1I_SHIFT)
#define CCU4_GSTAT_S2I_SHIFT          (2)                            /* Bits 2: CC42 IDLE status */
#define CCU4_GSTAT_S2I_MASK           (1 << CCU4_GSTAT_S2I_SHIFT)
#define CCU4_GSTAT_S3I_SHIFT          (3)                            /* Bits 3: CC43 IDLE status */
#define CCU4_GSTAT_S3I_MASK           (1 << CCU4_GSTAT_SI_SHIFT)
#define CCU4_GSTAT_PRB_SHIFT          (8)                            /* Bits 8: Prescaler Run Bit */
#define CCU4_GSTAT_PRB_MASK           (1 << CCU4_GSTAT_SI_SHIFT)

/* Global Idle Set (GIDLS) */

#define CCU4_GIDLS_SS0I_SHIFT          (0)                            /* Bits 0: CC40 IDLE mode set */
#define CCU4_GIDLS_SS0I_MASK           (1 << CCU4_GIDLS_SS0I_SHIFT)
#define CCU4_GIDLS_SS1I_SHIFT          (1)                            /* Bits 1: CC41 IDLE mode set */
#define CCU4_GIDLS_SS1I_MASK           (1 << CCU4_GIDLS_SS1I_SHIFT)
#define CCU4_GIDLS_SS2I_SHIFT          (2)                            /* Bits 2: CC42 IDLE mode set */
#define CCU4_GIDLS_SS2I_MASK           (1 << CCU4_GIDLS_SS2I_SHIFT)
#define CCU4_GIDLS_SS3I_SHIFT          (3)                            /* Bits 3: CC43 IDLE mode set */
#define CCU4_GIDLS_SS3I_MASK           (1 << CCU4_GIDLS_SS3I_SHIFT)
#define CCU4_GIDLS_CPRB_SHIFT          (8)                            /* Bits 8: Prescaler Run Bit Clear */
#define CCU4_GIDLS_CPRB_MASK           (1 << CCU4_GIDLS_CPRB_SHIFT)
#define CCU4_GIDLS_PSIC_SHIFT          (9)                            /* Bits 9: Prescaler clear */
#define CCU4_GIDLS_PSIC_MASK           (1 << CCU4_GIDLS_PSIC_SHIFT)

/* Global Idle Clear (GIDLC) */

