apache/nuttx/arch/arm/src/xmc4/hardware/xmc4_ccu4.h
#define CCU4_GIDLC_CS0I_SHIFT          (0)                            /* Bits 0: CC40 IDLE mode clear */
#define CCU4_GIDLC_CS0I_MASK           (1 << CCU4_GIDLC_CS0I_SHIFT)
#define CCU4_GIDLC_CS1I_SHIFT          (1)                            /* Bits 1: CC41 IDLE mode clear */
#define CCU4_GIDLC_CS1I_MASK           (1 << CCU4_GIDLC_CS1I_SHIFT)
#define CCU4_GIDLC_CS2I_SHIFT          (2)                            /* Bits 2: CC42 IDLE mode clear */
#define CCU4_GIDLC_CS2I_MASK           (1 << CCU4_GIDLC_CS2I_SHIFT)
#define CCU4_GIDLC_CS3I_SHIFT          (3)                            /* Bits 3: CC43 IDLE mode clear */
#define CCU4_GIDLC_CS3I_MASK           (1 << CCU4_GIDLC_CS3I_SHIFT)
#define CCU4_GIDLC_SPRB_SHIFT          (8)                            /* Bits 8: Prescaler Run Bit Set */
#define CCU4_GIDLC_SPRB_MASK           (1 << CCU4_GIDLC_SPRB_SHIFT)

/* Global Channel Set (GCSS) */

#define CCU4_GCSS_S0SE_SHIFT            (0)                             /* Bits 0: Slice 0 shadow transfer set enable */
#define CCU4_GCSS_S0SE_MASK             (1 << CCU4_GCSS_S0SE_SHIFT)
#define CCU4_GCSS_S0DSE_SHIFT           (1)                             /* Bits 1: Slice 0 Dither shadow transfer set enable */
#define CCU4_GCSS_S0DSE_MASK            (1 << CCU4_GCSS_S0DSE_SHIFT)
#define CCU4_GCSS_S0PSE_SHIFT           (2)                             /* Bits 2: Slice 0 Prescaler shadow transfer set enable */
#define CCU4_GCSS_S0PSE_MASK            (1 << CCU4_GCSS_S0PSE_SHIFT)
#define CCU4_GCSS_S1SE_SHIFT            (4)                             /* Bits 4: Slice 1 shadow transfer set enable */
#define CCU4_GCSS_S1SE_MASK             (1 << CCU4_GCSS_S1SE_SHIFT)
#define CCU4_GCSS_S1DSE_SHIFT           (5)                             /* Bits 5: Slice 1 Dither shadow transfer set enable */
#define CCU4_GCSS_S1DSE_MASK            (1 << CCU4_GCSS_S1DSE_SHIFT)
#define CCU4_GCSS_S1PSE_SHIFT           (6)                             /* Bits 6: Slice 1 Prescaler shadow transfer set enable */
#define CCU4_GCSS_S1PSE_MASK            (1 << CCU4_GCSS_S1PSE_SHIFT)
#define CCU4_GCSS_S2SE_SHIFT            (8)                             /* Bits 8: Slice 2 shadow transfer set enable */
#define CCU4_GCSS_S2SE_MASK             (1 << CCU4_GCSS_S2SE_SHIFT)
#define CCU4_GCSS_S2DSE_SHIFT           (9)                             /* Bits 9: Slice 2 Dither shadow transfer set enable */
#define CCU4_GCSS_S2DSE_MASK            (1 << CCU4_GCSS_S2DSE_SHIFT)
#define CCU4_GCSS_S2PSE_SHIFT           (10)                            /* Bits 10: Slice 2 Prescaler shadow transfer set enable */
#define CCU4_GCSS_S2PSE_MASK            (1 << CCU4_GCSS_S2PSE_SHIFT)
#define CCU4_GCSS_S3SE_SHIFT            (12)                            /* Bits 12: Slice 3 shadow transfer set enable */
#define CCU4_GCSS_S3SE_MASK             (1 << CCU4_GCSS_S3SE_SHIFT)
#define CCU4_GCSS_S3DSE_SHIFT           (13)                            /* Bits 13: Slice 3 Dither shadow transfer set enable */
#define CCU4_GCSS_S3DSE_MASK            (1 << CCU4_GCSS_S3DSE_SHIFT)
#define CCU4_GCSS_S3PSE_SHIFT           (14)                            /* Bits 14: Slice 3 Prescaler shadow transfer set enable */
#define CCU4_GCSS_S3PSE_MASK            (1 << CCU4_GCSS_S3PSE_SHIFT)
#define CCU4_GCSS_S0STS_SHIFT           (16)                            /* Bits 16: Slice 0 status bit set */
#define CCU4_GCSS_S0STS_MASK            (1 << CCU4_GCSS_S0STS_SHIFT)
#define CCU4_GCSS_S1STS_SHIFT           (17)                            /* Bits 17: Slice 1 status bit set */
#define CCU4_GCSS_S1STS_MASK            (1 << CCU4_GCSS_S1STS_SHIFT)
#define CCU4_GCSS_S2STS_SHIFT           (18)                            /* Bits 18: Slice 2 status bit set */
#define CCU4_GCSS_S2STS_MASK            (1 << CCU4_GCSS_S2STS_SHIFT)
#define CCU4_GCSS_S3STS_SHIFT           (19)                            /* Bits 19: Slice 3 status bit set */
#define CCU4_GCSS_S3STS_MASK            (1 << CCU4_GCSS_S3STS_SHIFT)

/* Global Channel Clear (GCSC) */

#define CCU4_GCSC_S0SC_SHIFT            (0)                             /* Bits 0: Slice 0 shadow transfer clear */
#define CCU4_GCSC_S0SC_MASK             (1 << CCU4_GCSC_S0SC_SHIFT)
#define CCU4_GCSC_S0DSC_SHIFT           (1)                             /* Bits 1: Slice 0 Dither shadow transfer clear */
#define CCU4_GCSC_S0DSC_MASK            (1 << CCU4_GCSC_S0DSC_SHIFT)
#define CCU4_GCSC_S0PSC_SHIFT           (2)                             /* Bits 2: Slice 0 Prescaler shadow transfer clear */
#define CCU4_GCSC_S0PSC_MASK            (1 << CCU4_GCSC_S0PSC_SHIFT)
#define CCU4_GCSC_S1SC_SHIFT            (4)                             /* Bits 4: Slice 1 shadow transfer clear */
#define CCU4_GCSC_S1SC_MASK             (1 << CCU4_GCSC_S1SC_SHIFT)
#define CCU4_GCSC_S1DSC_SHIFT           (5)                             /* Bits 5: Slice 1 Dither shadow transfer clear */
#define CCU4_GCSC_S1DSC_MASK            (1 << CCU4_GCSC_S1DSC_SHIFT)
#define CCU4_GCSC_S1PSC_SHIFT           (6)                             /* Bits 6: Slice 1 Prescaler shadow transfer clear */
#define CCU4_GCSC_S1PSC_MASK            (1 << CCU4_GCSC_S1PSC_SHIFT)
#define CCU4_GCSC_S2SC_SHIFT            (8)                             /* Bits 8: Slice 2 shadow transfer clear */
#define CCU4_GCSC_S2SC_MASK             (1 << CCU4_GCSC_S2SC_SHIFT)
#define CCU4_GCSC_S2DSC_SHIFT           (9)                             /* Bits 9: Slice 2 Dither shadow transfer clear */
#define CCU4_GCSC_S2DSC_MASK            (1 << CCU4_GCSC_S2DSC_SHIFT)
#define CCU4_GCSC_S2PSC_SHIFT           (10)                            /* Bits 10: Slice 2 Prescaler shadow transfer clear */
#define CCU4_GCSC_S2PSC_MASK            (1 << CCU4_GCSC_S2PSC_SHIFT)
#define CCU4_GCSC_S3SC_SHIFT            (12)                            /* Bits 12: Slice 3 shadow transfer clear */
#define CCU4_GCSC_S3SC_MASK             (1 << CCU4_GCSC_S3SC_SHIFT)
#define CCU4_GCSC_S3DSC_SHIFT           (13)                            /* Bits 13: Slice 3 Dither shadow transfer clear */
#define CCU4_GCSC_S3DSC_MASK            (1 << CCU4_GCSC_S3DSC_SHIFT)
#define CCU4_GCSC_S3PSC_SHIFT           (14)                            /* Bits 14: Slice 3 Prescaler shadow transfer clear */
#define CCU4_GCSC_S3PSC_MASK            (1 << CCU4_GCSC_S3PSC_SHIFT)
#define CCU4_GCSC_S0STC_SHIFT           (16)                            /* Bits 16: Slice 0 status bit clear */
#define CCU4_GCSC_S0STC_MASK            (1 << CCU4_GCSC_S0STC_SHIFT)
#define CCU4_GCSC_S1STC_SHIFT           (17)                            /* Bits 17: Slice 1 status bit clear */
#define CCU4_GCSC_S1STC_MASK            (1 << CCU4_GCSC_S1STC_SHIFT)
#define CCU4_GCSC_S2STC_SHIFT           (18)                            /* Bits 18: Slice 2 status bit clear */
#define CCU4_GCSC_S2STC_MASK            (1 << CCU4_GCSC_S2STC_SHIFT)
#define CCU4_GCSC_S3STC_SHIFT           (19)                            /* Bits 19: Slice 3 status bit clear */
#define CCU4_GCSC_S3STC_MASK            (1 << CCU4_GCSC_S3STC_SHIFT)

/* Global Channel Clear (GCST) */

