apache/nuttx/arch/arm/src/xmc4/hardware/xmc4_ccu4.h
#define CCU4_GCST_S0SS_SHIFT            (0)                             /* Bits 0: Slice 0 shadow transfer status */
#define CCU4_GCST_S0SS_MASK             (1 << CCU4_GCST_S0SS_SHIFT)
#define CCU4_GCST_S0DSS_SHIFT           (1)                             /* Bits 1: Slice 0 Dither shadow transfer status */
#define CCU4_GCST_S0DSS_MASK            (1 << CCU4_GCST_S0DSS_SHIFT)
#define CCU4_GCST_S0PSS_SHIFT           (2)                             /* Bits 2: Slice 0 Prescaler shadow transfer status */
#define CCU4_GCST_S0PSS_MASK            (1 << CCU4_GCST_S0PSS_SHIFT)
#define CCU4_GCST_S1SS_SHIFT            (4)                             /* Bits 4: Slice 1 shadow transfer status */
#define CCU4_GCST_S1SS_MASK             (1 << CCU4_GCST_S1SS_SHIFT)
#define CCU4_GCST_S1DSS_SHIFT           (5)                             /* Bits 5: Slice 1 Dither shadow transfer status */
#define CCU4_GCST_S1DSS_MASK            (1 << CCU4_GCST_S1DSS_SHIFT)
#define CCU4_GCST_S1PSS_SHIFT           (6)                             /* Bits 6: Slice 1 Prescaler shadow transfer status */
#define CCU4_GCST_S1PSS_MASK            (1 << CCU4_GCST_S1PSS_SHIFT)
#define CCU4_GCST_S2SS_SHIFT            (8)                             /* Bits 8: Slice 2 shadow transfer status */
#define CCU4_GCST_S2SS_MASK             (1 << CCU4_GCST_S2SS_SHIFT)
#define CCU4_GCST_S2DSS_SHIFT           (9)                             /* Bits 9: Slice 2 Dither shadow transfer status */
#define CCU4_GCST_S2DSS_MASK            (1 << CCU4_GCST_S2DSS_SHIFT)
#define CCU4_GCST_S2PSS_SHIFT           (10)                            /* Bits 10: Slice 2 Prescaler shadow transfer status */
#define CCU4_GCST_S2PSS_MASK            (1 << CCU4_GCST_S2PSS_SHIFT)
#define CCU4_GCST_S3SS_SHIFT            (12)                            /* Bits 12: Slice 3 shadow transfer status */
#define CCU4_GCST_S3SS_MASK             (1 << CCU4_GCST_S3SS_SHIFT)
#define CCU4_GCST_S3DSS_SHIFT           (13)                            /* Bits 13: Slice 3 Dither shadow transfer status */
#define CCU4_GCST_S3DSS_MASK            (1 << CCU4_GCST_S3DSS_SHIFT)
#define CCU4_GCST_S3PSS_SHIFT           (14)                            /* Bits 14: Slice 3 Prescaler shadow transfer status */
#define CCU4_GCST_S3PSS_MASK            (1 << CCU4_GCST_S3PSS_SHIFT)
#define CCU4_GCST_CC40ST_SHIFT          (16)                            /* Bits 16: Slice 0 status bit */
#define CCU4_GCST_CC40ST_MASK           (1 << CCU4_GCST_CC40ST_SHIFT)
#define CCU4_GCST_CC41ST_SHIFT          (17)                            /* Bits 17: Slice 1 status bit */
#define CCU4_GCST_CC41ST_MASK           (1 << CCU4_GCST_CC41ST_SHIFT)
#define CCU4_GCST_CC42ST_SHIFT          (18)                            /* Bits 18: Slice 2 status bit */
#define CCU4_GCST_CC42ST_MASK           (1 << CCU4_GCST_CC42ST_SHIFT)
#define CCU4_GCST_CC43ST_SHIFT          (19)                            /* Bits 19: Slice 3 status bit */
#define CCU4_GCST_CC43ST_MASK           (1 << CCU4_GCST_CC43ST_SHIFT)

/* Module Identification (MIDR) */

#define CCU4_MIDR_MODR_SHIFT            (0)                               /* Bits 0: Module Revision */
#define CCU4_MIDR_MODR_MASK             (0xFF << CCU4_MIDR_MODR_SHIFT)
#define CCU4_MIDR_MODT_SHIFT            (8)                               /* Bits 8: Module Type */
#define CCU4_MIDR_MODT_MASK             (0xFF << CCU4_MIDR_MODT_SHIFT)
#define CCU4_MIDR_MODN_SHIFT            (16)                              /* Bits 16: Module Number */
#define CCU4_MIDR_MODN_MASK             (0xFFFF << CCU4_MIDR_MODN_SHIFT)

/* Slice (CC4y) Registers [y = 0-3] */

/* Input Selector Configuration (CC4yINS) */

#define CCU4_CC4_INS_EV0IS_SHIFT                (0)                                     /* Bits 0-3: Event 0 signal selection */
#define CCU4_CC4_INS_EV0IS_MASK                 (15 << CCU4_CC4_INS_EV0IS_SHIFT)        
#   define CCU4_CC4_INS_EV0IS_INA               (0 << CCU4_CC4_INS_EV0IS_SHIFT)         /* CCU4x.INyA */
#   define CCU4_CC4_INS_EV0IS_INB               (1 << CCU4_CC4_INS_EV0IS_SHIFT)         /* CCU4x.INyB */
#   define CCU4_CC4_INS_EV0IS_INC               (2 << CCU4_CC4_INS_EV0IS_SHIFT)         /* CCU4x.INyC */
#   define CCU4_CC4_INS_EV0IS_IND               (3 << CCU4_CC4_INS_EV0IS_SHIFT)         /* CCU4x.INyD */
#   define CCU4_CC4_INS_EV0IS_INE               (4 << CCU4_CC4_INS_EV0IS_SHIFT)         /* CCU4x.INyE */
#   define CCU4_CC4_INS_EV0IS_INF               (5 << CCU4_CC4_INS_EV0IS_SHIFT)         /* CCU4x.INyF */
#   define CCU4_CC4_INS_EV0IS_ING               (6 << CCU4_CC4_INS_EV0IS_SHIFT)         /* CCU4x.INyG */
#   define CCU4_CC4_INS_EV0IS_INH               (7 << CCU4_CC4_INS_EV0IS_SHIFT)         /* CCU4x.INyH */
#   define CCU4_CC4_INS_EV0IS_INI               (8 << CCU4_CC4_INS_EV0IS_SHIFT)         /* CCU4x.INyI */
#   define CCU4_CC4_INS_EV0IS_INJ               (9 << CCU4_CC4_INS_EV0IS_SHIFT)         /* CCU4x.INyJ */
#   define CCU4_CC4_INS_EV0IS_INK               (10 << CCU4_CC4_INS_EV0IS_SHIFT)        /* CCU4x.INyK */
#   define CCU4_CC4_INS_EV0IS_INL               (11 << CCU4_CC4_INS_EV0IS_SHIFT)        /* CCU4x.INyL */
#   define CCU4_CC4_INS_EV0IS_INM               (12 << CCU4_CC4_INS_EV0IS_SHIFT)        /* CCU4x.INyM */
#   define CCU4_CC4_INS_EV0IS_INN               (13 << CCU4_CC4_INS_EV0IS_SHIFT)        /* CCU4x.INyN */
#   define CCU4_CC4_INS_EV0IS_INO               (14 << CCU4_CC4_INS_EV0IS_SHIFT)        /* CCU4x.INyO */
#   define CCU4_CC4_INS_EV0IS_INP               (15 << CCU4_CC4_INS_EV0IS_SHIFT)        /* CCU4x.INyP */
#define CCU4_CC4_INS_EV1IS_SHIFT                (4)                                     /* Bits 4-7: Event 1 signal selection */
#define CCU4_CC4_INS_EV1IS_MASK                 (15 << CCU4_CC4_INS_EV1IS_SHIFT)        
#   define CCU4_CC4_INS_EV1IS_INA               (0 << CCU4_CC4_INS_EV1IS_SHIFT)         /* CCU4x.INyA */
#   define CCU4_CC4_INS_EV1IS_INB               (1 << CCU4_CC4_INS_EV1IS_SHIFT)         /* CCU4x.INyB */
#   define CCU4_CC4_INS_EV1IS_INC               (2 << CCU4_CC4_INS_EV1IS_SHIFT)         /* CCU4x.INyC */
#   define CCU4_CC4_INS_EV1IS_IND               (3 << CCU4_CC4_INS_EV1IS_SHIFT)         /* CCU4x.INyD */
#   define CCU4_CC4_INS_EV1IS_INE               (4 << CCU4_CC4_INS_EV1IS_SHIFT)         /* CCU4x.INyE */
#   define CCU4_CC4_INS_EV1IS_INF               (5 << CCU4_CC4_INS_EV1IS_SHIFT)         /* CCU4x.INyF */
#   define CCU4_CC4_INS_EV1IS_ING               (6 << CCU4_CC4_INS_EV1IS_SHIFT)         /* CCU4x.INyG */
#   define CCU4_CC4_INS_EV1IS_INH               (7 << CCU4_CC4_INS_EV1IS_SHIFT)         /* CCU4x.INyH */
#   define CCU4_CC4_INS_EV1IS_INI               (8 << CCU4_CC4_INS_EV1IS_SHIFT)         /* CCU4x.INyI */
#   define CCU4_CC4_INS_EV1IS_INJ               (9 << CCU4_CC4_INS_EV1IS_SHIFT)         /* CCU4x.INyJ */
#   define CCU4_CC4_INS_EV1IS_INK               (10 << CCU4_CC4_INS_EV1IS_SHIFT)        /* CCU4x.INyK */
#   define CCU4_CC4_INS_EV1IS_INL               (11 << CCU4_CC4_INS_EV1IS_SHIFT)        /* CCU4x.INyL */
#   define CCU4_CC4_INS_EV1IS_INM               (12 << CCU4_CC4_INS_EV1IS_SHIFT)        /* CCU4x.INyM */
#   define CCU4_CC4_INS_EV1IS_INN               (13 << CCU4_CC4_INS_EV1IS_SHIFT)        /* CCU4x.INyN */
#   define CCU4_CC4_INS_EV1IS_INO               (14 << CCU4_CC4_INS_EV1IS_SHIFT)        /* CCU4x.INyO */
#   define CCU4_CC4_INS_EV1IS_INP               (15 << CCU4_CC4_INS_EV1IS_SHIFT)        /* CCU4x.INyP */
#define CCU4_CC4_INS_EV2IS_SHIFT                (8)                                     /* Bits 8-11: Event 2 signal selection */
#define CCU4_CC4_INS_EV2IS_MASK                 (15 << CCU4_CC4_INS_EV2IS_SHIFT)        
#   define CCU4_CC4_INS_EV2IS_INA               (0 << CCU4_CC4_INS_EV2IS_SHIFT)         /* CCU4x.INyA */
#   define CCU4_CC4_INS_EV2IS_INB               (1 << CCU4_CC4_INS_EV2IS_SHIFT)         /* CCU4x.INyB */
#   define CCU4_CC4_INS_EV2IS_INC               (2 << CCU4_CC4_INS_EV2IS_SHIFT)         /* CCU4x.INyC */
#   define CCU4_CC4_INS_EV2IS_IND               (3 << CCU4_CC4_INS_EV2IS_SHIFT)         /* CCU4x.INyD */
#   define CCU4_CC4_INS_EV2IS_INE               (4 << CCU4_CC4_INS_EV2IS_SHIFT)         /* CCU4x.INyE */
#   define CCU4_CC4_INS_EV2IS_INF               (5 << CCU4_CC4_INS_EV2IS_SHIFT)         /* CCU4x.INyF */
#   define CCU4_CC4_INS_EV2IS_ING               (6 << CCU4_CC4_INS_EV2IS_SHIFT)         /* CCU4x.INyG */
#   define CCU4_CC4_INS_EV2IS_INH               (7 << CCU4_CC4_INS_EV2IS_SHIFT)         /* CCU4x.INyH */
#   define CCU4_CC4_INS_EV2IS_INI               (8 << CCU4_CC4_INS_EV2IS_SHIFT)         /* CCU4x.INyI */
#   define CCU4_CC4_INS_EV2IS_INJ               (9 << CCU4_CC4_INS_EV2IS_SHIFT)         /* CCU4x.INyJ */
#   define CCU4_CC4_INS_EV2IS_INK               (10 << CCU4_CC4_INS_EV2IS_SHIFT)        /* CCU4x.INyK */
#   define CCU4_CC4_INS_EV2IS_INL               (11 << CCU4_CC4_INS_EV2IS_SHIFT)        /* CCU4x.INyL */
#   define CCU4_CC4_INS_EV2IS_INM               (12 << CCU4_CC4_INS_EV2IS_SHIFT)        /* CCU4x.INyM */
#   define CCU4_CC4_INS_EV2IS_INN               (13 << CCU4_CC4_INS_EV2IS_SHIFT)        /* CCU4x.INyN */
#   define CCU4_CC4_INS_EV2IS_INO               (14 << CCU4_CC4_INS_EV2IS_SHIFT)        /* CCU4x.INyO */
#   define CCU4_CC4_INS_EV2IS_INP               (15 << CCU4_CC4_INS_EV2IS_SHIFT)        /* CCU4x.INyP */
#define CCU4_CC4_INS_EV0EM_SHIFT                (16)                                    /* Bits 16-17: Event 0 Edge Selection */
#define CCU4_CC4_INS_EV0EM_MASK                 (3 << CCU4_CC4_INS_EV0EM_SHIFT)
#   define CCU4_CC4_INS_EV0EM_NA                (0 << CCU4_CC4_INS_EV0EM_SHIFT)         /* No action */
#   define CCU4_CC4_INS_EV0EM_RE                (1 << CCU4_CC4_INS_EV0EM_SHIFT)         /* Signal active on rising edge */
#   define CCU4_CC4_INS_EV0EM_FE                (2 << CCU4_CC4_INS_EV0EM_SHIFT)         /* Signal active on falling edge */
#   define CCU4_CC4_INS_EV0EM_BE                (3 << CCU4_CC4_INS_EV0EM_SHIFT)         /* Signal active on both edges */
#define CCU4_CC4_INS_EV1EM_SHIFT                (18)                                    /* Bits 18-19: Event 1 Edge Selection */
#define CCU4_CC4_INS_EV1EM_MASK                 (3 << CCU4_CC4_INS_EV1EM_SHIFT)
#   define CCU4_CC4_INS_EV1EM_NA                (0 << CCU4_CC4_INS_EV1EM_SHIFT)         /* No action */
#   define CCU4_CC4_INS_EV1EM_RE                (1 << CCU4_CC4_INS_EV1EM_SHIFT)         /* Signal active on rising edge */
#   define CCU4_CC4_INS_EV1EM_FE                (2 << CCU4_CC4_INS_EV1EM_SHIFT)         /* Signal active on falling edge */
#   define CCU4_CC4_INS_EV1EM_BE                (3 << CCU4_CC4_INS_EV1EM_SHIFT)         /* Signal active on both edges */
#define CCU4_CC4_INS_EV2EM_SHIFT                (20)                                    /* Bits 20-21: Event 2 Edge Selection */
#define CCU4_CC4_INS_EV2EM_MASK                 (0x300000 << CCU4_CC4_INS_EV2EM_SHIFT)
#   define CCU4_CC4_INS_EV2EM_NA                (0 << CCU4_CC4_INS_EV2EM_SHIFT)         /* No action */
#   define CCU4_CC4_INS_EV2EM_RE                (1 << CCU4_CC4_INS_EV2EM_SHIFT)         /* Signal active on rising edge */
#   define CCU4_CC4_INS_EV2EM_FE                (2 << CCU4_CC4_INS_EV2EM_SHIFT)         /* Signal active on falling edge */
#   define CCU4_CC4_INS_EV2EM_BE                (3 << CCU4_CC4_INS_EV2EM_SHIFT)         /* Signal active on both edges */
#define CCU4_CC4_INS_EV0LM_SHIFT                (22)                                    /* Bit 22: Event 0 Level Selection */
#define CCU4_CC4_INS_EV0LM_MASK                 (1 << CCU4_CC4_INS_EV0LM_SHIFT)
#define CCU4_CC4_INS_EV1LM_SHIFT                (23)                                    /* Bit 23: Event 1 Level Selection */
#define CCU4_CC4_INS_EV1LM_MASK                 (1 << CCU4_CC4_INS_EV1LM_SHIFT)
#define CCU4_CC4_INS_EV2LM_SHIFT                (24)                                    /* Bit 24: Event 2 Level Selection */
#define CCU4_CC4_INS_EV2LM_MASK                 (1 << CCU4_CC4_INS_EV2LM_SHIFT)
#define CCU4_CC4_INS_LPF0M_SHIFT                (25)                                    /* Bits 25-26: Event 0 Low Pass Filter Configuration */
#define CCU4_CC4_INS_LPF0M_MASK                 (3 << CCU4_CC4_INS_LPF0M_SHIFT)
#   define CCU4_CC4_INS_LPF0M_DISABLED          (0 << CCU4_CC4_INS_LPF0M_SHIFT)         /* LPF is disabled */
#   define CCU4_CC4_INS_LPF0M_3CC               (1 << CCU4_CC4_INS_LPF0M_SHIFT)         /* 3 clock cycles of fCCU4 */
#   define CCU4_CC4_INS_LPF0M_5CC               (2 << CCU4_CC4_INS_LPF0M_SHIFT)         /* 5 clock cycles of fCCU4 */
#   define CCU4_CC4_INS_LPF0M_7CC               (3 << CCU4_CC4_INS_LPF0M_SHIFT)         /* 7 clock cycles of fCCU4 */
#define CCU4_CC4_INS_LPF1M_SHIFT                (27)                                    /* Bits 27-28: Event 1 Low Pass Filter Configuration */
#define CCU4_CC4_INS_LPF1M_MASK                 (3 << CCU4_CC4_INS_LPF1M_SHIFT)
#   define CCU4_CC4_INS_LPF1M_DISABLED          (0 << CCU4_CC4_INS_LPF1M_SHIFT)         /* LPF is disabled */
#   define CCU4_CC4_INS_LPF1M_3CC               (1 << CCU4_CC4_INS_LPF1M_SHIFT)         /* 3 clock cycles of fCCU4 */
#   define CCU4_CC4_INS_LPF1M_5CC               (2 << CCU4_CC4_INS_LPF1M_SHIFT)         /* 5 clock cycles of fCCU4 */
#   define CCU4_CC4_INS_LPF1M_7CC               (3 << CCU4_CC4_INS_LPF1M_SHIFT)         /* 7 clock cycles of fCCU4 */
#define CCU4_CC4_INS_LPF2M_SHIFT                (29)                                    /* Bits 29-30: Event 2 Low Pass Filter Configuration */
#define CCU4_CC4_INS_LPF2M_MASK                 (3 << CCU4_CC4_INS_LPF2M_SHIFT)
#   define CCU4_CC4_INS_LPF2M_DISABLED          (0 << CCU4_CC4_INS_LPF2M_SHIFT)         /* LPF is disabled */
#   define CCU4_CC4_INS_LPF2M_3CC               (1 << CCU4_CC4_INS_LPF2M_SHIFT)         /* 3 clock cycles of fCCU4 */
#   define CCU4_CC4_INS_LPF2M_5CC               (2 << CCU4_CC4_INS_LPF2M_SHIFT)         /* 5 clock cycles of fCCU4 */
#   define CCU4_CC4_INS_LPF2M_7CC               (3 << CCU4_CC4_INS_LPF2M_SHIFT)         /* 7 clock cycles of fCCU4 */

/* Connection Matrix Control (CC4yCMC) */

#define CCU4_CC4_CMC_STRTS_SHIFT           (0)                                          /* Bits 0-1: External Start Functionality Selector */
#define CCU4_CC4_CMC_STRTS_MASK            (3 << CCU4_CC4_CMC_STRTS_SHIFT)
#define CCU4_CC4_CMC_ENDS_SHIFT            (2)                                          /* Bits 2-3: External Stop Functionality Selector */
#define CCU4_CC4_CMC_ENDS_MASK             (3 << CCU4_CC4_CMC_ENDS_SHIFT)
#define CCU4_CC4_CMC_CAP0S_SHIFT           (4)                                          /* Bits 4-5: External Capture 0 Functionality Selector */
#define CCU4_CC4_CMC_CAP0S_MASK            (3 << CCU4_CC4_CMC_CAP0S_SHIFT)
#define CCU4_CC4_CMC_CAP1S_SHIFT           (6)                                          /* Bits 6-7: External Capture 1 Functionality Selector */
#define CCU4_CC4_CMC_CAP1S_MASK            (3 << CCU4_CC4_CMC_CAP1S_SHIFT)
#define CCU4_CC4_CMC_GATES_SHIFT           (8)                                          /* Bits 8-9: External Gate Functionality Selector */
#define CCU4_CC4_CMC_GATES_MASK            (3 << CCU4_CC4_CMC_GATES_SHIFT)
#define CCU4_CC4_CMC_UDS_SHIFT             (10)                                         /* Bits 10-11: External Up/Down Functionality Selector */
#define CCU4_CC4_CMC_UDS_MASK              (3 << CCU4_CC4_CMC_UDS_SHIFT)
#define CCU4_CC4_CMC_LDS_SHIFT             (12)                                         /* Bits 12-13: External Timer Load Functionality Selector */
#define CCU4_CC4_CMC_LDS_MASK              (3 << CCU4_CC4_CMC_LDS_SHIFT)
#define CCU4_CC4_CMC_CNTS_SHIFT            (14)                                         /* Bits 14-15: External Count Selector */
#define CCU4_CC4_CMC_CNTS_MASK             (3 << CCU4_CC4_CMC_CNTS_SHIFT)
#define CCU4_CC4_CMC_OFS_SHIFT             (16)                                         /* Bit 16: Override Function Selector */
#define CCU4_CC4_CMC_OFS_MASK              (1 << CCU4_CC4_CMC_OFS_SHIFT)
#define CCU4_CC4_CMC_TS_SHIFT              (17)                                         /* Bit 17: Trap Function Selector */
#define CCU4_CC4_CMC_TS_MASK               (1 << CCU4_CC4_CMC_TS_SHIFT)
#define CCU4_CC4_CMC_MOS_SHIFT             (18)                                         /* Bits 18-19: External Modulation Functionality Selector */
#define CCU4_CC4_CMC_MOS_MASK              (3 << CCU4_CC4_CMC_MOS_SHIFT)
#define CCU4_CC4_CMC_TCE_SHIFT             (20)                                         /* Bit 20: Timer Concatenation Enable */
#define CCU4_CC4_CMC_TCE_MASK              (1 << CCU4_CC4_CMC_TCE_SHIFT)

/* Slice Timer Status (CC4yTCST) */

#define CCU4_CC4_TCST_TRB_SHIFT             (0)                                     /* Bit 0: Timer Run Bit */
#define CCU4_CC4_TCST_TRB_MASK              (1 << CCU4_CC4_TCST_TRB_SHIFT)
#define CCU4_CC4_TCST_CDIR_SHIFT            (1)                                     /* Bit 1: Timer Counting Direction */
#define CCU4_CC4_TCST_CDIR_MASK             (1 << CCU4_CC4_TCST_CDIR_SHIFT)

/* Slice Timer Run Set (CC4yTCSET) */

#define CCU4_CC4_TCSET_TRBS_SHIFT           (0)                                     /* Bit 0: Timer Run Bit set */
#define CCU4_CC4_TCSET_TRBS_MASK            (1 << CCU4_CC4_TCSET_TRBS_SHIFT)

/* Slice Timer Clear (CC4yTCCLR) */

