apache/nuttx/arch/arm/src/xmc4/hardware/xmc4_ccu4.h
#define CCU4_CC4_TCCLR_TRBC_SHIFT           (0)                                     /* Bit 0: Timer Run Bit Clear */
#define CCU4_CC4_TCCLR_TRBC_MASK            (1 << CCU4_CC4_TCCLR_TRBC_SHIFT)
#define CCU4_CC4_TCCLR_TCC_SHIFT            (1)                                     /* Bit 1: Timer Clear */
#define CCU4_CC4_TCCLR_TCC_MASK             (1 << CCU4_CC4_TCCLR_TCC_SHIFT)
#define CCU4_CC4_TCCLR_DITC_SHIFT           (2)                                     /* Bit 2: Dither Counter Clear */
#define CCU4_CC4_TCCLR_DITC_MASK            (1 << CCU4_CC4_TCCLR_DITC_SHIFT)

/* Slice Timer Control  (CC4yTC) */

#define CCU4_CC4_TC_TCM_SHIFT               (0)                                     /* Bit 0: Timer Counting Mode */
#define CCU4_CC4_TC_TCM_MASK                (1 << CCU4_CC4_TC_TCM_SHIFT)
#define CCU4_CC4_TC_TSSM_SHIFT              (1)                                     /* Bit 1: Timer Single Shot Mode */
#define CCU4_CC4_TC_TSSM_MASK               (1 << CCU4_CC4_TC_TSSM_SHIFT)
#define CCU4_CC4_TC_CLST_SHIFT              (2)                                     /* Bit 2: Shadow Transfer on Clear */
#define CCU4_CC4_TC_CLST_MASK               (1 << CCU4_CC4_TC_CLST_SHIFT)
#define CCU4_CC4_TC_CMOD_SHIFT              (3)                                     /* Bit 3: Capture Compare Mode */
#define CCU4_CC4_TC_CMOD_MASK               (1 << CCU4_CC4_TC_CMOD_SHIFT)
#define CCU4_CC4_TC_ECM_SHIFT               (4)                                     /* Bit 4: Extended Capture Mode */
#define CCU4_CC4_TC_ECM_MASK                (1 << CCU4_CC4_TC_ECM_SHIFT)
#define CCU4_CC4_TC_CAPC_SHIFT              (5)                                     /* Bits 5-6: Clear on Capture Control */
#define CCU4_CC4_TC_CAPC_MASK               (3 << CCU4_CC4_TC_CAPC_SHIFT)
#define CCU4_CC4_TC_ENDM_SHIFT              (8)                                     /* Bits 8-9: Extended Stop Function Control */
#define CCU4_CC4_TC_ENDM_MASK               (3 << CCU4_CC4_TC_ENDM_SHIFT)
#define CCU4_CC4_TC_STRM_SHIFT              (10)                                    /* Bit 10: Extended Start Function Control */
#define CCU4_CC4_TC_STRM_MASK               (1 << CCU4_CC4_TC_STRM_SHIFT)
#define CCU4_CC4_TC_SCE_SHIFT               (11)                                    /* Bit 11: Equal Capture Event enable */
#define CCU4_CC4_TC_SCE_MASK                (1 << CCU4_CC4_TC_SCE_SHIFT)
#define CCU4_CC4_TC_CCS_SHIFT               (12)                                    /* Bit 12: Continuous Capture Enable */
#define CCU4_CC4_TC_CCS_MASK                (1 << CCU4_CC4_TC_CCS_SHIFT)
#define CCU4_CC4_TC_DITHE_SHIFT             (13)                                    /* Bits 13-14: Dither Enable */
#define CCU4_CC4_TC_DITHE_MASK              (3 << CCU4_CC4_TC_DITHE_SHIFT)
#define CCU4_CC4_TC_DIM_SHIFT               (15)                                    /* Bit 15: Dither input selector */
#define CCU4_CC4_TC_DIM_MASK                (1 << CCU4_CC4_TC_DIM_SHIFT)
#define CCU4_CC4_TC_FPE_SHIFT               (16)                                    /* Bit 16: Floating Prescaler enable */
#define CCU4_CC4_TC_FPE_MASK                (1 << CCU4_CC4_TC_FPE_SHIFT)
#define CCU4_CC4_TC_TRAPE_SHIFT             (17)                                    /* Bit 17: TRAP enable */
#define CCU4_CC4_TC_TRAPE_MASK              (1 << CCU4_CC4_TC_TRAPE_SHIFT)
#define CCU4_CC4_TC_TRPSE_SHIFT             (21)                                    /* Bit 21: TRAP Synchronization Enable */
#define CCU4_CC4_TC_TRPSE_MASK              (1 << CCU4_CC4_TC_TRPSE_SHIFT)
#define CCU4_CC4_TC_TRPSW_SHIFT             (22)                                    /* Bit 22: TRAP State Clear Control */
#define CCU4_CC4_TC_TRPSW_MASK              (1 << CCU4_CC4_TC_TRPSW_SHIFT)
#define CCU4_CC4_TC_EMS_SHIFT               (23)                                    /* Bit 23: External Modulation Synchronization */
#define CCU4_CC4_TC_EMS_MASK                (1 << CCU4_CC4_TC_EMS_SHIFT)
#define CCU4_CC4_TC_EMT_SHIFT               (24)                                    /* Bit 24: External Modulation Type */
#define CCU4_CC4_TC_EMT_MASK                (1 << CCU4_CC4_TC_EMT_SHIFT)
#define CCU4_CC4_TC_MCME_SHIFT              (25)                                    /* Bit 25: Multi Channel Mode Enable */
#define CCU4_CC4_TC_MCME_MASK               (1 << CCU4_CC4_TC_MCME_SHIFT)

/* Passive Level Config (CC4yPSL) */

#define CCU4_CC4_PSL_PSL_SHIFT               (0)                                    /* Bit 0: Output Passive Level */
#define CCU4_CC4_PSL_PSL_MASK                (1 << CCU4_CC4_PSL_PSL_SHIFT)

/* Dither Config (CC4yDIT) */

#define CCU4_CC4_DIT_DCV_SHIFT               (0)                                    /* Bits 0-3: Dither compare Value */
#define CCU4_CC4_DIT_DCV_MASK                (15 << CCU4_CC4_DIT_DCV_SHIFT)
#define CCU4_CC4_DIT_DCNT_SHIFT              (8)                                    /* Bits 8-11: Dither counter actual value */
#define CCU4_CC4_DIT_DCNT_MASK               (15 << CCU4_CC4_DIT_DCNT_SHIFT)

/* Dither Shadow Register (CC4yDITS) */

#define CCU4_CC4_DITS_DCVS_SHIFT             (0)                                    /* Bits 0-3: Dither Shadow Compare Value */
#define CCU4_CC4_DITS_DCVS_MASK              (15 << CCU4_CC4_DITS_DCVS_SHIFT)

/* Prescaler Control (CC4yPSC) */

#define CCU4_CC4_PSC_PSIV_SHIFT              (0)                                    /* Bits 0-3: Passive State Configuration */
#define CCU4_CC4_PSC_PSIV_MASK               (15 << CCU4_CC4_PSC_PSIV_SHIFT)

/* Floating Prescaler Control (CC4yFPC) */

#define CCU4_CC4_FPC_PCMP_SHIFT              (0)                                    /* Bits 0-3: Floating Prescaler Compare Value */
#define CCU4_CC4_FPC_PCMP_MASK               (15 << CCU4_CC4_FPC_PCMP_SHIFT)
#define CCU4_CC4_FPC_PVAL_SHIFT              (8)                                    /* Bits 8-11: Actual Prescaler Value */
#define CCU4_CC4_FPC_PVAL_MASK               (15 << CCU4_CC4_FPC_PVAL_SHIFT)

/* Floating Prescaler Shadow (CC4yFPCS) */

#define CCU4_CC4_FPCS_PCMP_SHIFT             (0)                                    /* Bits 0-3: Passive Comparator Pattern */
#define CCU4_CC4_FPCS_PCMP_MASK              (15 << CCU4_CC4_FPCS_PCMP_SHIFT)

/* Timer Period Value (CC4yPR) */

