apache/nuttx/arch/arm/src/xmc4/hardware/xmc4_ccu4.h
#define CCU4_CC4_PR_PR_SHIFT                 (0)                                    /* Bits 0-15: Period Register */
#define CCU4_CC4_PR_PR_MASK                  (0xFFFF << CCU4_CC4_PR_PR_SHIFT)

/* Timer Shadow Period Value (CC4yPRS) */

#define CCU4_CC4_PRS_PRS_SHIFT               (0)                                    /* Bits 0-15: Period Register */
#define CCU4_CC4_PRS_PRS_MASK                (0xFFFF << CCU4_CC4_PRS_PRS_SHIFT)

/* Timer Compare Value (CC4yCR) */

#define CCU4_CC4_CR_CR_SHIFT                 (0)                                    /* Bits 0-15: Compare Register Value */
#define CCU4_CC4_CR_CR_MASK                  (0xFFFF << CCU4_CC4_CR_CR_SHIFT)

/* Timer Shadow Compare Value (CC4yCRS) */

#define CCU4_CC4_CRS_CRS_SHIFT               (0)                                    /* Bits 0-15: Compare Register */
#define CCU4_CC4_CRS_CRS_MASK                (0xFFFF << CCU4_CC4_CRS_CRS_SHIFT)

/* Timer Value (CC4yTIMER) */

#define CCU4_CC4_TIMER_TVAL_SHIFT            (0)                                    /* Bits 0-15: Timer Value */
#define CCU4_CC4_TIMER_TVAL_MASK             (0xFFFF << CCU4_CC4_TIMER_TVAL_SHIFT)

/* Capture Register 0 (CC4yC0V) */

#define CCU4_CC4_C0V_CAPTV_SHIFT              (0)                                   /* Bits 0-15: Capture Value */
#define CCU4_CC4_C0V_CAPTV_MASK               (0xFFFF << CCU4_CC4_C0V_CAPTV_SHIFT)
#define CCU4_CC4_C0V_FPCV_SHIFT               (16)                                  /* Bits 16-19: Prescaler Value */
#define CCU4_CC4_C0V_FPCV_MASK                (15 << CCU4_CC4_C0V_FPCV_SHIFT)
#define CCU4_CC4_C0V_FFL_SHIFT                (20)                                  /* Bit 20: Full Flag */
#define CCU4_CC4_C0V_FFL_MASK                 (1 << CCU4_CC4_C0V_FFL_SHIFT)

/* Capture Register 1 (CC4yC1V) */

#define CCU4_CC4_C1V_CAPTV_SHIFT              (0)                                   /* Bits 0-15: Capture Value */
#define CCU4_CC4_C1V_CAPTV_MASK               (0xFFFF << CCU4_CC4_C1V_CAPTV_SHIFT)
#define CCU4_CC4_C1V_FPCV_SHIFT               (16)                                  /* Bits 16-19: Prescaler Value */
#define CCU4_CC4_C1V_FPCV_MASK                (15 << CCU4_CC4_C1V_FPCV_SHIFT)
#define CCU4_CC4_C1V_FFL_SHIFT                (20)                                  /* Bit 20: Full Flag */
#define CCU4_CC4_C1V_FFL_MASK                 (1 << CCU4_CC4_C1V_FFL_SHIFT)

/* Capture Register 2 (CC4yC2V) */

#define CCU4_CC4_C2V_CAPTV_SHIFT              (0)                                   /* Bits 0-15: Capture Value */
#define CCU4_CC4_C2V_CAPTV_MASK               (0xFFFF << CCU4_CC4_C2V_CAPTV_SHIFT)
#define CCU4_CC4_C2V_FPCV_SHIFT               (16)                                  /* Bits 16-19: Prescaler Value */
#define CCU4_CC4_C2V_FPCV_MASK                (15 << CCU4_CC4_C2V_FPCV_SHIFT)
#define CCU4_CC4_C2V_FFL_SHIFT                (20)                                  /* Bit 20: Full Flag */
#define CCU4_CC4_C2V_FFL_MASK                 (1 << CCU4_CC4_C2V_FFL_SHIFT)

/* Capture Register 3 (CC4yC3V) */

#define CCU4_CC4_C3V_CAPTV_SHIFT              (0)                                   /* Bits 0-15: Capture Value */
#define CCU4_CC4_C3V_CAPTV_MASK               (0xFFFF << CCU4_CC4_C3V_CAPTV_SHIFT)
#define CCU4_CC4_C3V_FPCV_SHIFT               (16)                                  /* Bits 16-19: Prescaler Value */
#define CCU4_CC4_C3V_FPCV_MASK                (15 << CCU4_CC4_C3V_FPCV_SHIFT)
#define CCU4_CC4_C3V_FFL_SHIFT                (20)                                  /* Bit 20: Full Flag */
#define CCU4_CC4_C3V_FFL_MASK                 (1 << CCU4_CC4_C3V_FFL_SHIFT)

/* Interrupt Status (CC4yINTS) */

#define CCU4_CC4_INTS_PMUS_SHIFT             (0)                                    /* Bit 0: Period Match while Counting Up */
#define CCU4_CC4_INTS_PMUS_MASK              (1 << CCU4_CC4_INTS_PMUS_SHIFT)
#define CCU4_CC4_INTS_OMDS_SHIFT             (1)                                    /* Bit 1: One Match while Counting Down */
#define CCU4_CC4_INTS_OMDS_MASK              (1 << CCU4_CC4_INTS_OMDS_SHIFT)
#define CCU4_CC4_INTS_CMUS_SHIFT             (2)                                    /* Bit 2: Compare Match while Counting Up */
#define CCU4_CC4_INTS_CMUS_MASK              (1 << CCU4_CC4_INTS_CMUS_SHIFT)
#define CCU4_CC4_INTS_CMDS_SHIFT             (3)                                    /* Bit 3: Compare Match while Counting Down */
#define CCU4_CC4_INTS_CMDS_MASK              (1 << CCU4_CC4_INTS_CMDS_SHIFT)
#define CCU4_CC4_INTS_E0AS_SHIFT             (8)                                    /* Bit 8: Event 0 Detection Status */
#define CCU4_CC4_INTS_E0AS_MASK              (1 << CCU4_CC4_INTS_E0AS_SHIFT)
#define CCU4_CC4_INTS_E1AS_SHIFT             (9)                                    /* Bit 9: Event 1 Detection Status */
#define CCU4_CC4_INTS_E1AS_MASK              (1 << CCU4_CC4_INTS_E1AS_SHIFT)
#define CCU4_CC4_INTS_E2AS_SHIFT             (10)                                   /* Bit 10: Event 2 Detection Status */
#define CCU4_CC4_INTS_E2AS_MASK              (1 << CCU4_CC4_INTS_E2AS_SHIFT)
#define CCU4_CC4_INTS_TRPF_SHIFT             (11)                                   /* Bit 11: Trap Flag Status */
#define CCU4_CC4_INTS_TRPF_MASK              (1 << CCU4_CC4_INTS_TRPF_SHIFT)

/* Interrupt Enable Control (CC4yINTE) */

#define CCU4_CC4_INTE_PME_SHIFT              (0)                                    /* Bit 0: Period match while counting up enable */
#define CCU4_CC4_INTE_PME_MASK               (1 << CCU4_CC4_INTE_PME_SHIFT)
#define CCU4_CC4_INTE_OME_SHIFT              (1)                                    /* Bit 1: One match while counting down enable */
#define CCU4_CC4_INTE_OME_MASK               (1 << CCU4_CC4_INTE_OME_SHIFT)
#define CCU4_CC4_INTE_CMUE_SHIFT             (2)                                    /* Bit 2: Compare match while counting up enable */
#define CCU4_CC4_INTE_CMUE_MASK              (1 << CCU4_CC4_INTE_CMUE_SHIFT)
#define CCU4_CC4_INTE_CMDE_SHIFT             (3)                                    /* Bit 3: Compare match while counting down enable */
#define CCU4_CC4_INTE_CMDE_MASK              (1 << CCU4_CC4_INTE_CMDE_SHIFT)
#define CCU4_CC4_INTE_E0AE_SHIFT             (8)                                    /* Bit 8: Event 0 interrupt enable */
#define CCU4_CC4_INTE_E0AE_MASK              (1 << CCU4_CC4_INTE_E0AE_SHIFT)
#define CCU4_CC4_INTE_E1AE_SHIFT             (9)                                    /* Bit 9: Event 1 interrupt enable */
#define CCU4_CC4_INTE_E1AE_MASK              (1 << CCU4_CC4_INTE_E1AE_SHIFT)
#define CCU4_CC4_INTE_E2AE_SHIFT             (10)                                   /* Bit 10: Event 2 interrupt enable */
#define CCU4_CC4_INTE_E2AE_MASK              (1 << CCU4_CC4_INTE_E2AE_SHIFT)

/* Service Request Selector (CC4ySRS) */

#define CCU4_CC4_SRS_POSR_SHIFT              (0)                                    /* Bits 0-1: Period/One match Service request selector */
#define CCU4_CC4_SRS_POSR_MASK               (3 << CCU4_CC4_SRS_POSR_SHIFT)
#define CCU4_CC4_SRS_CMSR_SHIFT              (2)                                    /* Bits 2-3: Compare match Service request selector */
#define CCU4_CC4_SRS_CMSR_MASK               (3 << CCU4_CC4_SRS_CMSR_SHIFT)
#define CCU4_CC4_SRS_E0SR_SHIFT              (8)                                    /* Bits 8-9: Event 0 Service request selector */
#define CCU4_CC4_SRS_E0SR_MASK               (3 << CCU4_CC4_SRS_E0SR_SHIFT)
#define CCU4_CC4_SRS_E1SR_SHIFT              (10)                                   /* Bits 10-11: Event 1 Service request selector */
#define CCU4_CC4_SRS_E1SR_MASK               (3 << CCU4_CC4_SRS_E1SR_SHIFT)
#define CCU4_CC4_SRS_E2SR_SHIFT              (12)                                   /* Bits 12-13: Event 2 Service request selector */
#define CCU4_CC4_SRS_E2SR_MASK               (3 << CCU4_CC4_SRS_E2SR_SHIFT)

/* Interrupt Status Set (CC4ySWS) */

