apache/nuttx/arch/arm/src/xmc4/hardware/xmc4_ccu4.h
#define CCU4_CC4_SWS_SPM_SHIFT               (0)                                    /* Bit 0: Period match while counting up set */
#define CCU4_CC4_SWS_SPM_MASK                (1 << CCU4_CC4_SWS_SPM_SHIFT)
#define CCU4_CC4_SWS_SOM_SHIFT               (1)                                    /* Bit 1: One match while counting down set */
#define CCU4_CC4_SWS_SOM_MASK                (1 << CCU4_CC4_SWS_SOM_SHIFT)
#define CCU4_CC4_SWS_SCMU_SHIFT              (2)                                    /* Bit 2: Compare match while counting up set */
#define CCU4_CC4_SWS_SCMU_MASK               (1 << CCU4_CC4_SWS_SCMU_SHIFT)
#define CCU4_CC4_SWS_SCMD_SHIFT              (3)                                    /* Bit 3: Compare match while counting down set */
#define CCU4_CC4_SWS_SCMD_MASK               (1 << CCU4_CC4_SWS_SCMD_SHIFT)
#define CCU4_CC4_SWS_SE0A_SHIFT              (8)                                    /* Bit 8: Event 0 detection set */
#define CCU4_CC4_SWS_SE0A_MASK               (1 << CCU4_CC4_SWS_SE0A_SHIFT)
#define CCU4_CC4_SWS_SE1A_SHIFT              (9)                                    /* Bit 9: Event 1 detection set */
#define CCU4_CC4_SWS_SE1A_MASK               (1 << CCU4_CC4_SWS_SE1A_SHIFT)
#define CCU4_CC4_SWS_SE2A_SHIFT              (10)                                   /* Bit 10: Event 2 detection set */
#define CCU4_CC4_SWS_SE2A_MASK               (1 << CCU4_CC4_SWS_SE2A_SHIFT)
#define CCU4_CC4_SWS_STRPF_SHIFT             (11)                                   /* Bit 11: Trap Flag status set */
#define CCU4_CC4_SWS_STRPF_MASK              (1 << CCU4_CC4_SWS_STRPF_SHIFT)

/* Interrupt Status Clear (CC4ySWR) */

#define CCU4_CC4_SWR_RPM_SHIFT               (0)                                    /* Bit 0: Period match while counting up clear */
#define CCU4_CC4_SWR_RPM_MASK                (1 << CCU4_CC4_SWR_RPM_SHIFT)
#define CCU4_CC4_SWR_ROM_SHIFT               (1)                                    /* Bit 1: One match while counting down clear */
#define CCU4_CC4_SWR_ROM_MASK                (1 << CCU4_CC4_SWR_ROM_SHIFT)
#define CCU4_CC4_SWR_RCMU_SHIFT              (2)                                    /* Bit 2: Compare match while counting up clear */
#define CCU4_CC4_SWR_RCMU_MASK               (1 << CCU4_CC4_SWR_RCMU_SHIFT)
#define CCU4_CC4_SWR_RCMD_SHIFT              (3)                                    /* Bit 3: Compare match while counting down clear */
#define CCU4_CC4_SWR_RCMD_MASK               (1 << CCU4_CC4_SWR_RCMD_SHIFT)
#define CCU4_CC4_SWR_RE0A_SHIFT              (8)                                    /* Bit 8: Event 0 detection clear */
#define CCU4_CC4_SWR_RE0A_MASK               (1 << CCU4_CC4_SWR_RE0A_SHIFT)
#define CCU4_CC4_SWR_RE1A_SHIFT              (9)                                    /* Bit 9: Event 1 detection clear */
#define CCU4_CC4_SWR_RE1A_MASK               (1 << CCU4_CC4_SWR_RE1A_SHIFT)
#define CCU4_CC4_SWR_RE2A_SHIFT              (10)                                   /* Bit 10: Event 2 detection clear */
#define CCU4_CC4_SWR_RE2A_MASK               (1 << CCU4_CC4_SWR_RE2A_SHIFT)
#define CCU4_CC4_SWR_RTRPF_SHIFT             (11)                                   /* Bit 11: Trap Flag status clear */
#define CCU4_CC4_SWR_RTRPF_MASK              (1 << CCU4_CC4_SWR_RTRPF_SHIFT)

/* Extended Read Back 0 (CC4yECRD0) */

#define CCU4_CC4_ECRD0_CAPV_SHIFT            (0)                                    /* Bits 0-15: Timer Capture Value */
#define CCU4_CC4_ECRD0_CAPV_MASK             (0xFFFF << CCU4_CC4_ECRD0_CAPV_SHIFT)
#define CCU4_CC4_ECRD0_FPCV_SHIFT            (16)                                   /* Bits 16-19: Prescaler Capture value */
#define CCU4_CC4_ECRD0_FPCV_MASK             (15 << CCU4_CC4_ECRD0_FPCV_SHIFT)
#define CCU4_CC4_ECRD0_SPTR_SHIFT            (20)                                   /* Bits 20-21: Slice pointer */
#define CCU4_CC4_ECRD0_SPTR_MASK             (3 << CCU4_CC4_ECRD0_SPTR_SHIFT)
#define CCU4_CC4_ECRD0_VPTR_SHIFT            (22)                                   /* Bits 22-23: Capture register pointer */
#define CCU4_CC4_ECRD0_VPTR_MASK             (3 << CCU4_CC4_ECRD0_VPTR_SHIFT)
#define CCU4_CC4_ECRD0_FFL_SHIFT             (24)                                   /* Bit 24: Full Flag */
#define CCU4_CC4_ECRD0_FFL_MASK              (1 << CCU4_CC4_ECRD0_FFL_SHIFT)
#define CCU4_CC4_ECRD0_LCV_SHIFT             (25)                                   /* Bit 25: Lost Capture Value */
#define CCU4_CC4_ECRD0_LCV_MASK              (1 << CCU4_CC4_ECRD0_LCV_SHIFT)

/* Extended Read Back 1 (CC4yECRD1) */

#define CCU4_CC4_ECRD1_CAPV_SHIFT            (0)                                    /* Bits 0-15: Timer Capture Value */
#define CCU4_CC4_ECRD1_CAPV_MASK             (0xFFFF << CCU4_CC4_ECRD1_CAPV_SHIFT)
#define CCU4_CC4_ECRD1_FPCV_SHIFT            (16)                                   /* Bits 16-19: Prescaler Capture value */
#define CCU4_CC4_ECRD1_FPCV_MASK             (15 << CCU4_CC4_ECRD1_FPCV_SHIFT)
#define CCU4_CC4_ECRD1_SPTR_SHIFT            (20)                                   /* Bits 20-21: Slice pointer */
#define CCU4_CC4_ECRD1_SPTR_MASK             (3 << CCU4_CC4_ECRD1_SPTR_SHIFT)
#define CCU4_CC4_ECRD1_VPTR_SHIFT            (22)                                   /* Bits 22-23: Capture register pointer */
#define CCU4_CC4_ECRD1_VPTR_MASK             (3 << CCU4_CC4_ECRD1_VPTR_SHIFT)
#define CCU4_CC4_ECRD1_FFL_SHIFT             (24)                                   /* Bit 24: Full Flag */
#define CCU4_CC4_ECRD1_FFL_MASK              (1 << CCU4_CC4_ECRD1_FFL_SHIFT)
#define CCU4_CC4_ECRD1_LCV_SHIFT             (25)                                   /* Bit 25: Lost Capture Value */
#define CCU4_CC4_ECRD1_LCV_MASK              (1 << CCU4_CC4_ECRD1_LCV_SHIFT)

#endif /* __ARCH_ARM_SRC_XMC4_HARDWARE_XMC4_CCU4_H */
